# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources (README.md file)
- Happy learning!

In [2]:
import numpy as np
import pandas as pd

In [29]:
from scipy.stats import ttest_1samp

# Challenge 1 - Exploring the Data

In this challenge, we will examine all salaries of employees of the City of Chicago. We will start by loading the dataset and examining its contents

In [3]:
# Run this code:

salaries = pd.read_csv('../Current_Employee_Names__Salaries__and_Position_Titles.csv')

In [4]:
salaries

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86
...,...,...,...,...,...,...,...,...
33178,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,72510.0,NaN
33179,"ZYMANTAS, LAURA C",POLICE OFFICER,POLICE,F,Salary,NaN,48078.0,NaN
33180,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
33181,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
33182,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,F,Salary,NaN,115932.0,NaN

Examine the `salaries` dataset using the `head` function below.

In [5]:
salaries.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86

We see from looking at the `head` function that there is quite a bit of missing data. Let's examine how much missing data is in each column. Produce this output in the cell below

In [6]:
salaries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33183 entries, 0 to 33182
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               33183 non-null  object
 1   Job Titles         33183 non-null  object
 2   Department         33183 non-null  object
 3   Full or Part-Time  33183 non-null  object
 4   Salary or Hourly   33183 non-null  object
 5   Typical Hours      8022 non-null   float64
 6   Annual Salary      25161 non-null  float64
 7   Hourly Rate        8022 non-null   float64
dtypes: float64(3), object(5)
memory usage: 2.0+ MB

In [7]:
salaries.isnull().sum()

Name                     0
Job Titles               0
Department               0
Full or Part-Time        0
Salary or Hourly         0
Typical Hours        25161
Annual Salary         8022
Hourly Rate          25161
dtype: int64

Let's also look at the count of hourly vs. salaried employees. Write the code in the cell below

In [8]:
salaries[salaries['Salary or Hourly']=='Salary'].count()

Name                 25161
Job Titles           25161
Department           25161
Full or Part-Time    25161
Salary or Hourly     25161
Typical Hours            0
Annual Salary        25161
Hourly Rate              0
dtype: int64

In [9]:
salaries[salaries['Salary or Hourly']=='Hourly'].count()

Name                 8022
Job Titles           8022
Department           8022
Full or Part-Time    8022
Salary or Hourly     8022
Typical Hours        8022
Annual Salary           0
Hourly Rate          8022
dtype: int64

What this information indicates is that the table contains information about two types of employees - salaried and hourly. Some columns apply only to one type of employee while other columns only apply to another kind. This is why there are so many missing values. Therefore, we will not do anything to handle the missing values.

There are different departments in the city. List all departments and the count of employees in each department.

In [19]:
salaries.groupby(['Department'])['Job Titles'].count()

Department
ADMIN HEARNG                39
ANIMAL CONTRL               81
AVIATION                  1629
BOARD OF ELECTION          107
BOARD OF ETHICS              8
BUDGET & MGMT               46
BUILDINGS                  269
BUSINESS AFFAIRS           171
CITY CLERK                  84
CITY COUNCIL               411
COMMUNITY DEVELOPMENT      207
COPA                       116
CULTURAL AFFAIRS            65
DISABILITIES                28
DoIT                        99
FAMILY & SUPPORT           615
FINANCE                    560
FIRE                      4641
GENERAL SERVICES           980
HEALTH                     488
HUMAN RELATIONS             16
HUMAN RESOURCES             79
INSPECTOR GEN               87
LAW                        407
LICENSE APPL COMM            1
MAYOR'S OFFICE              85
OEMC                      2102
POLICE                   13414
POLICE BOARD                 2
PROCUREMENT                 92
PUBLIC LIBRARY            1015
STREETS & SAN             2198
TRANSPORTN                1140
TREASURER                   22
WATER MGMNT               1879
Name: Job Titles, dtype: int64

# Challenge 2 - Hypothesis Tests

In this section of the lab, we will test whether the hourly wage of all hourly workers is significantly different from $30/hr. Import the correct one sample test function from scipy and perform the hypothesis test for a 95% two sided confidence interval.

In [21]:
hourly_data = salaries[salaries['Salary or Hourly'] == 'Hourly']
hourly_data

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86
6,"ABBATACOLA, ROBERT J",ELECTRICAL MECHANIC,AVIATION,F,Hourly,40.0,NaN,46.10
7,"ABBATE, JOSEPH L",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
10,"ABBOTT, BETTY L",FOSTER GRANDPARENT,FAMILY & SUPPORT,P,Hourly,20.0,NaN,2.65
18,"ABDULLAH, LAKENYA N",CROSSING GUARD,OEMC,P,Hourly,20.0,NaN,17.68
...,...,...,...,...,...,...,...,...
33164,"ZUREK, FRANCIS",ELECTRICAL MECHANIC,OEMC,F,Hourly,40.0,NaN,46.10
33168,"ZWARYCZ MANN, IRENE A",CROSSING GUARD,OEMC,P,Hourly,20.0,NaN,17.68
33169,"ZWARYCZ, THOMAS J",POOL MOTOR TRUCK DRIVER,WATER MGMNT,F,Hourly,40.0,NaN,35.60
33174,"ZYGADLO, JOHN P",MACHINIST (AUTOMOTIVE),GENERAL SERVICES,F,Hourly,40.0,NaN,46.35
33175,"ZYGADLO, MICHAEL J",FRM OF MACHINISTS - AUTOMOTIVE,GENERAL SERVICES,F,Hourly,40.0,NaN,48.85

In [25]:
wages = hourly_data['Hourly Rate'].reset_index()
wages

      index  Hourly Rate
0         4        19.86
1         6        46.10
2         7        35.60
3        10         2.65
4        18        17.68
...     ...          ...
8017  33164        46.10
8018  33168        17.68
8019  33169        35.60
8020  33174        46.35
8021  33175        48.85

[8022 rows x 2 columns]

In [26]:
wages.mean()

index          16775.747320
Hourly Rate       32.788558
dtype: float64

In [34]:
ttest_1samp(wages['Hourly Rate'], 30, alternative='two-sided')

TtestResult(statistic=20.6198057854942, pvalue=4.3230240486229894e-92, df=8021)

Based on this information and the small p-value, we reject the null hypothesis and conclude that the mean hourly rate is significantly different from 30 USD per hour

We are also curious about salaries in the police force. The chief of police in Chicago claimed in a press briefing that salaries this year are higher than last year's mean of $86000/year a year for all salaried employees. Test this one sided hypothesis using a 95% confidence interval.

Hint: A one tailed test has a p-value that is half of the two tailed p-value. If our hypothesis is greater than, then to reject, the test statistic must also be positive.

In [44]:
police = salaries[salaries['Department']=='POLICE']['Annual Salary'].reset_index()

In [45]:
police.isnull().sum()

index             0
Annual Salary    10
dtype: int64

In [47]:
police.dropna(inplace=True)

In [48]:
police.head(10)

   index  Annual Salary
0      0       101442.0
1      1        94122.0
2      9        93354.0
3     11        84054.0
4     12        87006.0
5     14        84054.0
6     22        90024.0
7     25        48078.0
8     27        76266.0
9     28        48078.0

In [49]:
ttest_1samp(police['Annual Salary'], 86000, alternative='greater')

TtestResult(statistic=3.081997005712994, pvalue=0.0010301701775482569, df=13403)

We reject H0. What the chief of police said is true. The growth between this year's police dept. salaries is statistically signifcant.

Using the `crosstab` function, find the department that has the most hourly workers.

In [62]:
cross_tab = pd.crosstab(salaries['Department'], salaries['Salary or Hourly'])
hourly= cross_tab['Hourly'].reset_index()
hourly_sorted = hourly.sort_values(by='Hourly', ascending=False)
hourly_sorted

               Department  Hourly
31          STREETS & SAN    1862
34            WATER MGMNT    1513
26                   OEMC    1273
2                AVIATION    1082
18       GENERAL SERVICES     765
32             TRANSPORTN     725
30         PUBLIC LIBRARY     299
15       FAMILY & SUPPORT     287
9            CITY COUNCIL      64
16                FINANCE      44
23                    LAW      40
1           ANIMAL CONTRL      19
27                 POLICE      10
25         MAYOR'S OFFICE       8
7        BUSINESS AFFAIRS       7
12       CULTURAL AFFAIRS       7
10  COMMUNITY DEVELOPMENT       4
21        HUMAN RESOURCES       4
19                 HEALTH       3
29            PROCUREMENT       2
17                   FIRE       2
5           BUDGET & MGMT       2
20        HUMAN RELATIONS       0
22          INSPECTOR GEN       0
14                   DoIT       0
24      LICENSE APPL COMM       0
13           DISABILITIES       0
11                   COPA       0
8              CITY CLERK       0
28           POLICE BOARD       0
6               BUILDINGS       0
4         BOARD OF ETHICS       0
3       BOARD OF ELECTION       0
33              TREASURER       0
0            ADMIN HEARNG       0

In [65]:
hourly_sorted.max()

Department    WATER MGMNT
Hourly               1862
dtype: object

The workers from the department with the most hourly workers have complained that their hourly wage is less than $35/hour. Using a one sample t-test, test this one-sided hypothesis at the 95% confidence level.

In [71]:
water_mgmt = salaries[salaries['Department']=='WATER MGMNT'][['Hourly Rate','Department']].reset_index()
water_mgmt.dropna(inplace=True)

In [72]:
water_mgmt

      index  Hourly Rate   Department
4        40        45.07  WATER MGMNT
5        42        44.88  WATER MGMNT
6        52        48.25  WATER MGMNT
8        96        47.50  WATER MGMNT
10      182        40.20  WATER MGMNT
...     ...          ...          ...
1873  33103        40.20  WATER MGMNT
1874  33104        35.60  WATER MGMNT
1876  33132        48.25  WATER MGMNT
1877  33158        40.20  WATER MGMNT
1878  33169        35.60  WATER MGMNT

[1513 rows x 3 columns]

In [73]:
ttest_1samp(water_mgmt['Hourly Rate'], 35, alternative='less')

TtestResult(statistic=43.413059315519625, pvalue=1.0, df=1512)

Based on the results, we do not reject H0. As the p-value is 1, we can infer that the workers from the WATER MGMNT department are not earning less than $35/hour

# Challenge 3 - Constructing Confidence Intervals

While testing our hypothesis is a great way to gather empirical evidence for accepting or rejecting the hypothesis, another way to gather evidence is by creating a confidence interval. A confidence interval gives us information about the true mean of the population. So for a 95% confidence interval, we are 95% sure that the mean of the population is within the confidence interval. 
).

To read more about confidence intervals, click [here](https://en.wikipedia.org/wiki/Confidence_interval).


In the cell below, we will construct a 95% confidence interval for the mean hourly wage of all hourly workers. 

The confidence interval is computed in SciPy using the `t.interval` function. You can read more about this function [here](https://docs.scipy.org/doc/scipy-0.14.0/reference/generated/scipy.stats.t.html).

To compute the confidence interval of the hourly wage, use the 0.95 for the confidence level, number of rows - 1 for degrees of freedom, the mean of the sample for the location parameter and the standard error for the scale. The standard error can be computed using [this](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.sem.html) function in SciPy.

In [75]:
from scipy import stats

In [79]:
hourly_data['Hourly Rate']

4        19.86
6        46.10
7        35.60
10        2.65
18       17.68
         ...
33164    46.10
33168    17.68
33169    35.60
33174    46.35
33175    48.85
Name: Hourly Rate, Length: 8022, dtype: float64

In [80]:
hr_rates = hourly_data['Hourly Rate']

In [81]:
hr_rates

4        19.86
6        46.10
7        35.60
10        2.65
18       17.68
         ...
33164    46.10
33168    17.68
33169    35.60
33174    46.35
33175    48.85
Name: Hourly Rate, Length: 8022, dtype: float64

In [82]:
mean = np.mean(hr_rates)
std_dev = np.std(hr_rates)
std_error = stats.sem(hr_rates)

In [83]:
confidence_level = 0.95
degrees_of_freedom = len(hr_rates) - 1
confidence_interval = stats.t.interval(confidence_level, df=degrees_of_freedom, loc=mean, scale=std_error)

In [84]:
print("95% Confidence Interval for the Mean Hourly Wage:", confidence_interval)

95% Confidence Interval for the Mean Hourly Wage: (32.52345834488425, 33.05365708767623)

Now construct the 95% confidence interval for all salaried employeed in the police in the cell below.

# Challenge 4 - Hypothesis Tests of Proportions

Another type of one sample test is a hypothesis test of proportions. In this test, we examine whether the proportion of a group in our sample is significantly different than a fraction. 

You can read more about one sample proportion tests [here](http://sphweb.bumc.bu.edu/otlt/MPH-Modules/BS/SAS/SAS6-CategoricalData/SAS6-CategoricalData2.html).

In the cell below, use the `proportions_ztest` function from `statsmodels` to perform a hypothesis test that will determine whether the number of hourly workers in the City of Chicago is significantly different from 25% at the 95% confidence level.

In [86]:
len(salaries[salaries['Salary or Hourly'] == 'Hourly'])

8022

In [88]:
len(salaries)

33183

In [89]:
from statsmodels.stats.proportion import proportions_ztest

In [90]:
sample_size = len(salaries)
successes = len(hourly_data)  # Number of hourly workers in the dataset

In [91]:
null_hypothesis = 0.25
alternative_hypothesis = "Two-sided"

In [93]:
alternative_hypothesis = "two-sided"  # Updated alternative hypothesis value

z_stat, p_value = proportions_ztest(successes, sample_size, null_hypothesis, alternative=alternative_hypothesis)

In [94]:
z_stat, p_value

(-3.5099964213703005, 0.0004481127249057967)

We reject H0. As the p-value is almost 0. It is significantly different

In [95]:
successes/sample_size

0.24175029382515142